yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    Mouth detection sample (YOLOv8n ReLU6). Detects mouth open/closed.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "MouthDetectionModel.hpp"
#include "MouthYOLOv8PostProcessing.hpp"
#include "FaceDetectionModel.hpp"
#include "FaceDetectorPostProcessing.hpp"
#include "FaceDetectionResult.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include "ModelFileReader.h"
#include "ff.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__
//#define __USE_UVC__

#include "Profiler.hpp"

#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#if defined (__USE_UVC__)
    #include "UVC.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2

/* Same as working project: 0x82400000 (exercise model works at this addr) */
#define MODEL_AT_HYPERRAM_ADDR (0x82400000)

#define MOUTH_DETECTION_THRESHOLD  				(0.05f)
#define MOUTH_NMS_THRESHOLD  					(0.45f)
#define FACE_PRESENCE_THRESHOLD  				(0.4f)

/* Temporal smoothing: require N consecutive agreeing frames before switching state */
#define SPEAKING_HYSTERESIS_ON   3   /* frames of "mouth open" to switch to Speaking */
#define SPEAKING_HYSTERESIS_OFF  4   /* frames of "mouth closed" to switch to Not Speaking */

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

#define MAX_TRACKED_FACES 4

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::face_detection::DetectionResult> results_FD;  /* face boxes */
    std::vector<arm::app::face_detection::DetectionResult> results;       /* mouth detections */
    bool faceMouthOpen[MAX_TRACKED_FACES];  /* per-face raw mouth-open flag */
} S_FRAMEBUF;


S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
#define FACE_DETECTION_ACTIVATION_BUF_SZ (460000)
#define MOUTH_ACTIVATION_BUF_SZ          (512 * 1024)
static uint8_t tensorArena_FaceDetection[FACE_DETECTION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
static uint8_t tensorArena_Mouth[MOUTH_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }

    return NULL;
}

#define IMAGE_DISP_UPSCALE_FACTOR 2
#if defined(LT7381_LCD_PANEL)
#define FONT_DISP_UPSCALE_FACTOR 2
#else
#define FONT_DISP_UPSCALE_FACTOR 1
#endif

/* Image processing initiate function */
//Used by omv library
#if defined(__USE_UVC__)
//UVC only support QVGA, QQVGA
#define GLCD_WIDTH	320
#define GLCD_HEIGHT	240
#else
#define GLCD_WIDTH	320 //256
#define GLCD_HEIGHT	240 //256
#endif

//RGB565
#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

struct TrackedFace {
    float cx, cy;
    bool  isSpeaking;
    int   counter;
    int   missedFrames;
};

static TrackedFace g_tracked[MAX_TRACKED_FACES];
static bool g_trackedInit = false;

static void InitTrackedFaces()
{
    int i;
    for (i = 0; i < MAX_TRACKED_FACES; i++) {
        g_tracked[i].cx = -1.f;
        g_tracked[i].cy = -1.f;
        g_tracked[i].isSpeaking = false;
        g_tracked[i].counter = 0;
        g_tracked[i].missedFrames = 99;
    }
    g_trackedInit = true;
}

static int MatchOrCreateSlot(float cx, float cy)
{
    int bestSlot = -1;
    float bestDist = 9999999.f;
    int i;

    for (i = 0; i < MAX_TRACKED_FACES; i++) {
        if (g_tracked[i].missedFrames < 10) {
            float dx = g_tracked[i].cx - cx;
            float dy = g_tracked[i].cy - cy;
            float dist = dx * dx + dy * dy;
            if (dist < bestDist) {
                bestDist = dist;
                bestSlot = i;
            }
        }
    }

    /* Accept match if center moved less than 80 pixels */
    if (bestSlot >= 0 && bestDist < (80.f * 80.f))
        return bestSlot;

    /* No match — find an empty or oldest slot */
    int oldestSlot = 0;
    int oldestMissed = -1;
    for (i = 0; i < MAX_TRACKED_FACES; i++) {
        if (g_tracked[i].missedFrames >= 10) {
            g_tracked[i].isSpeaking = false;
            g_tracked[i].counter = 0;
            return i;
        }
        if (g_tracked[i].missedFrames > oldestMissed) {
            oldestMissed = g_tracked[i].missedFrames;
            oldestSlot = i;
        }
    }
    g_tracked[oldestSlot].isSpeaking = false;
    g_tracked[oldestSlot].counter = 0;
    return oldestSlot;
}

static bool SmoothPerFace(int slot, bool rawMouthOpen)
{
    if (rawMouthOpen) {
        if (!g_tracked[slot].isSpeaking) {
            g_tracked[slot].counter++;
            if (g_tracked[slot].counter >= SPEAKING_HYSTERESIS_ON) {
                g_tracked[slot].isSpeaking = true;
                g_tracked[slot].counter = 0;
            }
        } else {
            g_tracked[slot].counter = 0;
        }
    } else {
        if (g_tracked[slot].isSpeaking) {
            g_tracked[slot].counter++;
            if (g_tracked[slot].counter >= SPEAKING_HYSTERESIS_OFF) {
                g_tracked[slot].isSpeaking = false;
                g_tracked[slot].counter = 0;
            }
        } else {
            g_tracked[slot].counter = 0;
        }
    }
    return g_tracked[slot].isSpeaking;
}

static void DrawFacesPerState(
    const std::vector<arm::app::face_detection::DetectionResult> &faceResults,
    const bool perFaceSpeaking[],
    image_t *drawImg
)
{
    int greenBox = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);
    int redBox   = COLOR_R5_G6_B5_TO_RGB565(COLOR_R5_MAX, 0, 0);
    size_t i;

