yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/main.cpp
    for (i = 0; i < faceResults.size(); i++)
    {
        bool speaking = perFaceSpeaking[i];
        int boxColor = speaking ? greenBox : redBox;
        const char *label = speaking ? "Speaking" : "Not Speaking";

        const auto &r = faceResults[i];
        imlib_draw_rectangle(drawImg, r.m_x0, r.m_y0, r.m_w, r.m_h, boxColor, 2, false);

        int labelY = (r.m_y0 - 14 > 0) ? (r.m_y0 - 14) : r.m_y0;
        imlib_draw_string(drawImg, r.m_x0, labelY, label, boxColor, 2, 0, 0, false,
                          false, false, false, 0, false, false);
    }
}

static int32_t PrepareModelToHyperRAM(void)
{
#define MODEL_FILE "0:\\best_full_integer_quant_vela.tflite"
#define EACH_READ_SIZE 512
	
    TCHAR sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */	
    f_chdrive(sd_path);          /* set default path */

	int32_t i32FileSize;
	int32_t i32FileReadIndex = 0;
	int32_t i32Read;
	
	if(!ModelFileReader_Initialize(MODEL_FILE))
	{
        printf_err("Unable open model %s\n", MODEL_FILE);		
		return -1;
	}
	
	i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		i32FileReadIndex += i32Read;
	}
	
	if(i32FileReadIndex < i32FileSize)
	{
        printf_err("Read Model file size is not enough\n");		
		return -2;
	}
	
#if 0
	/* verify */
	i32FileReadIndex = 0;
	ModelFileReader_Rewind();
	BYTE au8TempBuf[EACH_READ_SIZE];
	
	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)au8TempBuf, EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		
		if(std::memcmp(au8TempBuf, (void *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), i32Read)!= 0)
		{
			printf_err("verify the model file content is incorrect at %i \n", i32FileReadIndex);		
			return -3;
		}
		i32FileReadIndex += i32Read;
	}
	
#endif	
	ModelFileReader_Finish();
	
	return i32FileSize;
}	


int main()
{
    /* Initialise the UART module to allow printf related functions (if using retarget) */
    BoardInit();
    info("main: BoardInit done, loading model...\n");

	/* Copy model file from SD to HyperRAM*/
	int32_t i32ModelSize;
		
	i32ModelSize = PrepareModelToHyperRAM();

	if(i32ModelSize <= 0 )
	{
        printf_err("Failed to prepare model\n");
        return 1;
	}

    /* Ensure SD writes to HyperRAM are visible before CPU reads model */
    __DSB();
    __DMB();

    /* Sanity check: verify TFLite magic at model start (TFL3 at offset 4) */
    const uint8_t *pModel = (const uint8_t *)MODEL_AT_HYPERRAM_ADDR;
    if (i32ModelSize < 12 || pModel[4] != 0x54 || pModel[5] != 0x46 || pModel[6] != 0x4c || pModel[7] != 0x33)
    {
        printf_err("Invalid TFLite model at 0x%08x: bad magic or size (len=%d)\n",
                   (unsigned)MODEL_AT_HYPERRAM_ADDR, (int)i32ModelSize);
        return 1;
    }
    info("Model magic TFL3 OK, readable from HyperRAM\n");

    /* Face detection model (embedded) */
    arm::app::FaceDetectionModel faceDetectionModel;
    if (!faceDetectionModel.Init(arm::app::tensorArena_FaceDetection,
                               sizeof(arm::app::tensorArena_FaceDetection),
                               (unsigned char *)arm::app::face_detection::GetModelPointer(),
                               arm::app::face_detection::GetModelLen()))
    {
        printf_err("Failed to initialise face detection model\n");
        return 1;
    }
    info("Face detection model init OK\n");

    /* Mouth model (from SD card) */
    arm::app::MouthDetectionModel model;
    if (!model.Init(arm::app::tensorArena_Mouth,
                    sizeof(arm::app::tensorArena_Mouth),
                    (unsigned char *)MODEL_AT_HYPERRAM_ADDR,
                    i32ModelSize))
    {
        printf_err("Failed to initialise mouth model\n");
        return 1;
    }
    info("Mouth model init OK\n");

    /* Setup MPU for tensor arenas */
    info("Set tensor arena cache policy to WTRA\n");
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            // SRAM for face detection tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArena_FaceDetection),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArena_FaceDetection) + FACE_DETECTION_ACTIVATION_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
        {
            // SRAM for mouth tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArena_Mouth),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArena_Mouth) + MOUTH_ACTIVATION_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)fb_array),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#if (NUM_FRAMEBUF == 2)
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)frame_buf1),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)frame_buf1) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#endif
    };

    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

