yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/main.cpp
    TfLiteTensor *inputTensor   = model.GetInputTensor(0);

    if (!inputTensor->dims)
    {
        printf_err("Invalid input tensor dims\n");
        return 2;
    }
    else if (inputTensor->dims->size < 3)
    {
        printf_err("Input tensor dimension should be >= 3\n");
        return 3;
    }

    TfLiteIntArray *inputShape = model.GetInputShape(0);

    const int inputImgCols = inputShape->data[arm::app::MouthDetectionModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::MouthDetectionModel::ms_inputRowsIdx];
    const uint32_t nChannels = inputShape->data[arm::app::MouthDetectionModel::ms_inputChannelsIdx];

    if (inputImgRows != inputImgCols)
    {
        printf_err("Mouth model input must be square (got %dx%d)\n", inputImgRows, inputImgCols);
        return 4;
    }

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);

    /* Face detection: input 192x192 grayscale */
    TfLiteIntArray *inputShape_FD = faceDetectionModel.GetInputShape(0);
    const int inputImgCols_FD = inputShape_FD->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    const int inputImgRows_FD = inputShape_FD->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];
    TfLiteTensor *outputTensor0_FD = faceDetectionModel.GetOutputTensor(0);
    TfLiteTensor *outputTensor1_FD = faceDetectionModel.GetOutputTensor(1);
    const arm::app::face_detection::PostProcessParams postProcessParams_FD{
        inputImgRows_FD,
        inputImgCols_FD,
        GLCD_HEIGHT,
        GLCD_WIDTH,
        anchor1,
        anchor2,
        FACE_PRESENCE_THRESHOLD,
        0.45f,
        1,  /* numClasses */
        0   /* topN */
    };
    arm::app::FaceDetectorPostProcess postProcess_FD(outputTensor0_FD, outputTensor1_FD,
        s_asFramebuf[0].results_FD, postProcessParams_FD);

    /* Mouth PP anchor grids must match trained input size (e.g. 128 vs 192) */
    arm::app::mouth_detection::MouthYOLOv8PostProcessing postProcess(&model,
        MOUTH_DETECTION_THRESHOLD,
        MOUTH_NMS_THRESHOLD,
        inputImgRows);
	
    //display framebuffer
    image_t frameBuffer;
    rectangle_t roi;

    //omv library init
    omv_init();
    framebuffer_init_image(&frameBuffer);

#if defined(__PROFILE__)

    arm::app::Profiler profiler;
    uint64_t u64StartCycle;
    uint64_t u64EndCycle;
    uint64_t u64CCAPStartCycle;
    uint64_t u64CCAPEndCycle;
#else
    pmu_reset_counters();
#endif

#define EACH_PERF_SEC 5
    uint64_t u64PerfCycle;
    uint64_t u64PerfFrames = 0;

    u64PerfCycle = pmu_get_systick_Count();
    u64PerfCycle += (SystemCoreClock * EACH_PERF_SEC);

    S_FRAMEBUF *infFramebuf;
    S_FRAMEBUF *fullFramebuf;
    S_FRAMEBUF *emptyFramebuf;

    //Setup image senosr
    ImageSensor_Init();
    ImageSensor_Config(eIMAGE_FMT_RGB565, frameBuffer.w, frameBuffer.h, true);

#if defined (__USE_DISPLAY__)
    char szDisplayText[100];
    S_DISP_RECT sDispRect;

    Display_Init();
    Display_ClearLCD(C_WHITE);
#endif

#if defined (__USE_UVC__)
	UVC_Init();
    HSUSBD_Start();
#endif

    while (1)
    {
        emptyFramebuf = get_empty_framebuf();

        if (emptyFramebuf)
        {
            //capture frame from CCAP
#if defined(__PROFILE__)
            u64CCAPStartCycle = pmu_get_systick_Count();
#endif

            ImageSensor_TriggerCapture((uint32_t)(emptyFramebuf->frameImage.data));
		}
		
        fullFramebuf = get_full_framebuf();

        if (fullFramebuf)
        {
            fullFramebuf->results_FD.clear();
            fullFramebuf->results.clear();

            /* --- Step 1: Face detection on full frame (192x192 grayscale) --- */
            TfLiteTensor *inputTensor_FD = faceDetectionModel.GetInputTensor(0);
            roi.x = 0;
            roi.y = 0;
            roi.w = fullFramebuf->frameImage.w;
            roi.h = fullFramebuf->frameImage.h;
            image_t resizeImg_FD;
            resizeImg_FD.w = inputImgCols_FD;
            resizeImg_FD.h = inputImgRows_FD;
            resizeImg_FD.data = (uint8_t *)inputTensor_FD->data.data;
            resizeImg_FD.pixfmt = PIXFORMAT_GRAYSCALE;
            imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg_FD, &roi);

            auto *req_FD = static_cast<uint8_t *>(inputTensor_FD->data.data);
            auto *signed_FD = static_cast<int8_t *>(inputTensor_FD->data.data);
            for (size_t i = 0; i < inputTensor_FD->bytes; i++)
            {
                int32_t v = static_cast<int32_t>(req_FD[i]) - 128;
                signed_FD[i] = static_cast<int8_t>(v);
            }
            faceDetectionModel.RunInference();
            postProcess_FD.RunPostProcess(fullFramebuf->results_FD);

            /* Expand face boxes 1.4x (like FaceLandmark) */
            float scaleFactorH = 1.4f;
            for (size_t i = 0; i < fullFramebuf->results_FD.size(); i++)
            {
                auto *fb = &fullFramebuf->results_FD[i];
                float scaleW = scaleFactorH * fb->m_h;
                float scaleH = scaleFactorH * fb->m_h;
                int newX = fb->m_x0 - (int)((scaleW - fb->m_w) / 2);
                int newY = fb->m_y0 - (int)((scaleH - fb->m_h) / 2);
                if (newX < 0) newX = 0;
                if (newY < 0) newY = 0;
                int newW = (int)scaleW;
                int newH = (int)scaleH;
                if (newX + newW >= (int)fullFramebuf->frameImage.w)
                    newW = fullFramebuf->frameImage.w - newX;
                if (newY + newH >= (int)fullFramebuf->frameImage.h)
                    newH = fullFramebuf->frameImage.h - newY;
                fb->m_x0 = newX;
                fb->m_y0 = newY;
                fb->m_w = newW;
                fb->m_h = newH;
            }

            /* --- Step 2: For each face, crop and run mouth model --- */
            static std::vector<arm::app::face_detection::DetectionResult> s_mouthTemp;
            {
                size_t f;
                size_t maxFaces = fullFramebuf->results_FD.size();
                if (maxFaces > MAX_TRACKED_FACES) maxFaces = MAX_TRACKED_FACES;

                for (f = 0; f < MAX_TRACKED_FACES; f++)
                    fullFramebuf->faceMouthOpen[f] = false;

                for (f = 0; f < maxFaces; f++)
                {
                    const auto &faceBox = fullFramebuf->results_FD[f];
                    roi.x = faceBox.m_x0;
                    roi.y = faceBox.m_y0;
                    roi.w = faceBox.m_w;
                    roi.h = faceBox.m_h;

                    image_t resizeImg;
                    resizeImg.w = inputImgCols;
                    resizeImg.h = inputImgRows;
                    resizeImg.data = (uint8_t *)inputTensor->data.data;
                    resizeImg.pixfmt = PIXFORMAT_RGB888;
                    imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg, &roi);

                    auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
                    auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);
                    for (size_t i = 0; i < inputTensor->bytes; i++)
                    {
                        int32_t v = static_cast<int32_t>(req_data[i]) - 128;
                        signed_req_data[i] = static_cast<int8_t>(v);
                    }
                    model.RunInference();

