yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/main.cpp
                    s_mouthTemp.clear();
                    postProcess.RunPostProcessing(inputImgRows, inputImgCols, (uint32_t)roi.h, (uint32_t)roi.w, s_mouthTemp);

                    /* Check if this face has mouth open */
                    size_t m;
                    for (m = 0; m < s_mouthTemp.size(); m++) {
                        if (s_mouthTemp[m].m_classId == 1) {
                            fullFramebuf->faceMouthOpen[f] = true;
                            break;
                        }
                    }

                    /* Offset mouth results to full-frame coords */
                    for (m = 0; m < s_mouthTemp.size(); m++)
                    {
                        auto r = s_mouthTemp[m];
                        r.m_x0 += faceBox.m_x0;
                        r.m_y0 += faceBox.m_y0;
                        fullFramebuf->results.push_back(r);
                    }
                }
            }

            fullFramebuf->eState = eFRAMEBUF_INF;
        }
        infFramebuf = get_inf_framebuf();

        if (infFramebuf)
        {
            if (!g_trackedInit) InitTrackedFaces();

            /* Per-face: match to tracked slots, smooth, build per-face speaking array */
            bool perFaceSpeaking[MAX_TRACKED_FACES];
            {
                size_t fi;
                int i;

                /* Age all tracked faces */
                for (i = 0; i < MAX_TRACKED_FACES; i++)
                    g_tracked[i].missedFrames++;

                size_t numFaces = infFramebuf->results_FD.size();
                if (numFaces > MAX_TRACKED_FACES) numFaces = MAX_TRACKED_FACES;

                for (fi = 0; fi < numFaces; fi++) {
                    const auto &r = infFramebuf->results_FD[fi];
                    float cx = r.m_x0 + r.m_w * 0.5f;
                    float cy = r.m_y0 + r.m_h * 0.5f;

                    int slot = MatchOrCreateSlot(cx, cy);
                    g_tracked[slot].cx = cx;
                    g_tracked[slot].cy = cy;
                    g_tracked[slot].missedFrames = 0;

                    perFaceSpeaking[fi] = SmoothPerFace(slot, infFramebuf->faceMouthOpen[fi]);
                }
            }

#if defined(__PROFILE__)
			u64StartCycle = pmu_get_systick_Count();
#endif
            DrawFacesPerState(infFramebuf->results_FD, perFaceSpeaking, &infFramebuf->frameImage);
#if defined(__PROFILE__)
			u64EndCycle = pmu_get_systick_Count();
			info("draw cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

            //display result image
#if defined (__USE_DISPLAY__)
            //Display image on LCD
            sDispRect.u32TopLeftX = 0;
            sDispRect.u32TopLeftY = 0;
			sDispRect.u32BottonRightX = ((frameBuffer.w * IMAGE_DISP_UPSCALE_FACTOR) - 1);
			sDispRect.u32BottonRightY = ((frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR) - 1);

#if defined(__PROFILE__)
            u64StartCycle = pmu_get_systick_Count();
#endif

            Display_FillRect((uint16_t *)infFramebuf->frameImage.data, &sDispRect, IMAGE_DISP_UPSCALE_FACTOR);

#if defined(__PROFILE__)
            u64EndCycle = pmu_get_systick_Count();
            info("display image cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

#endif

#if defined (__USE_UVC__)
			if(UVC_IsConnect())
			{
#if (UVC_Color_Format == UVC_Format_YUY2)
				image_t RGB565Img;
				image_t YUV422Img;

				RGB565Img.w = infFramebuf->frameImage.w;
				RGB565Img.h = infFramebuf->frameImage.h;
				RGB565Img.data = (uint8_t *)infFramebuf->frameImage.data;
				RGB565Img.pixfmt = PIXFORMAT_RGB565;

				YUV422Img.w = RGB565Img.w;
				YUV422Img.h = RGB565Img.h;
				YUV422Img.data = (uint8_t *)infFramebuf->frameImage.data;
				YUV422Img.pixfmt = PIXFORMAT_YUV422;
				
				roi.x = 0;
				roi.y = 0;
				roi.w = RGB565Img.w;
				roi.h = RGB565Img.h;
				imlib_nvt_scale(&RGB565Img, &YUV422Img, &roi);
				
#else
				image_t origImg;
				image_t vflipImg;

				origImg.w = infFramebuf->frameImage.w;
				origImg.h = infFramebuf->frameImage.h;
				origImg.data = (uint8_t *)infFramebuf->frameImage.data;
				origImg.pixfmt = PIXFORMAT_RGB565;

				vflipImg.w = origImg.w;
				vflipImg.h = origImg.h;
				vflipImg.data = (uint8_t *)infFramebuf->frameImage.data;
				vflipImg.pixfmt = PIXFORMAT_RGB565;

				imlib_nvt_vflip(&origImg, &vflipImg);
#endif
				UVC_SendImage((uint32_t)infFramebuf->frameImage.data, IMAGE_FB_SIZE, uvcStatus.StillImage);				

			}

#endif

            u64PerfFrames ++;
			if ((uint64_t) pmu_get_systick_Count() > u64PerfCycle)
            {
                info("Total inference rate: %llu\n", u64PerfFrames / EACH_PERF_SEC);
#if defined (__USE_DISPLAY__)
                sprintf(szDisplayText, "Frame Rate %llu", u64PerfFrames / EACH_PERF_SEC);
                //sprintf(szDisplayText,"Time %llu",(uint64_t) pmu_get_systick_Count() / (uint64_t)SystemCoreClock);
                //info("Running %s sec \n", szDisplayText);

                sDispRect.u32TopLeftX = 0;
				sDispRect.u32TopLeftY = frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR;
				sDispRect.u32BottonRightX = (frameBuffer.w);
				sDispRect.u32BottonRightY = ((frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR) + (FONT_DISP_UPSCALE_FACTOR * FONT_HTIGHT) - 1);

                Display_ClearRect(C_WHITE, &sDispRect);
                Display_PutText(
                    szDisplayText,
                    strlen(szDisplayText),
                    0,
					frameBuffer.h * IMAGE_DISP_UPSCALE_FACTOR,
                    C_BLUE,
                    C_WHITE,
                    false,
					FONT_DISP_UPSCALE_FACTOR
                );
#endif
                u64PerfCycle = (uint64_t)pmu_get_systick_Count() + (uint64_t)(SystemCoreClock * EACH_PERF_SEC);
                u64PerfFrames = 0;
			}

            infFramebuf->eState = eFRAMEBUF_EMPTY;
		}

		//Wait CCAP ready
		if (emptyFramebuf)
		{
			//Capture new image

			ImageSensor_WaitCaptureDone();
#if defined(__PROFILE__)
			u64CCAPEndCycle = pmu_get_systick_Count();
			info("ccap capture cycles %llu \n", (u64CCAPEndCycle - u64CCAPStartCycle));
#endif
            emptyFramebuf->eState = eFRAMEBUF_FULL;		
		}
    }

    return 0;
}
